# Taps
tap 'shopify/shopify'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'ack'
brew 'ansible'
brew 'arduino-cli'
brew 'argon2'
brew 'asciinema'
brew 'aspell'
brew 'awscli'
brew 'babel'
brew 'bash' # Latest Bash version
brew 'bash-completion' # Latest Bash version
brew 'brotli'
brew 'ca-certificates'
brew 'certbot'
brew 'cmake'
brew 'coreutils' # Those that come with macOS are outdated
brew 'croc'
brew 'curl'
brew 'duck'
brew 'erlang'
brew 'ffmpeg'
brew 'fx'
brew 'fzf'
brew 'gd'
brew 'gdbm'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nmap'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'speedtest-cli'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'telnet'
brew 'thefuck'
brew 'tldr'
brew 'tree'
brew 'ugrep'
brew 'unzip'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'whois'
# brew 'youtube-dl'
brew 'z'

# Spatie Medialibrary
brew 'aom'
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'phpstan'
brew 'phpunit'
brew 'php@8.1'
brew 'python3'
brew 'pyenv'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'roots/tap/trellis-cli'
brew 'ruby'
brew 'ruby-build'
brew 'shellcheck'
brew 'shopify-cli'
brew 'sqlite'
brew 'supervisor'
brew 'terraform'
brew 'typescript'
brew 'vim'
brew 'webpack'
brew 'yarn'

# Apps
cask 'adobe-creative-cloud'
# cask 'bartender' # we use SetApp
cask 'betterzip'
# cask 'cleanmymac' # we use SetApp
# cask 'cleanshot' # we use SetApp
cask 'dash'
# cask 'dashlane'
cask 'dbngin'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'expressions'
cask 'fig'
cask 'foobar2000'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'helo'
cask 'home-assistant'
cask 'imageoptim'
cask 'insomnia'
cask 'invoker'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keybase'
cask 'lastpass'
cask 'little-snitch'
cask 'lunar'
cask 'micro-snitch'
cask 'microsoft-office'
cask 'moom'
cask 'numi'
cask 'pdf-squeezer'
cask 'permute'
cask 'phpmon'
# cask 'polymail'
cask 'postman'
cask 'proxyman'
cask 'raindropio'
cask 'ray'
cask 'raycast'
cask 'setapp'
cask 'sizzy'
cask 'skype'
cask 'spotify'
cask 'slack'
cask 'staruml'
# cask 'telegram-desktop' # Using MAS Below
cask 'tidal'
cask 'timing'
cask 'tinkerwell'
cask 'tor-browser'
cask 'tower'
cask 'tripmode'
cask 'vagrant'
cask 'visual-studio-code'
cask 'virtualbox'
cask 'whatsapp'
cask 'wifi-explorer'
cask 'world time pro'
cask 'zeplin'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Numbers', id: 409203825 # Using Excel through microsoft office above
mas 'Deliveries', id: 924726344
mas 'djay Pro AI', id: 450527929
mas 'Trello', id: 1278508951
mas 'Shazam', id: 897118787
mas 'Telegram', id: 747648890
mas 'Bonsai Time Tracker', id: 1333596451
